#Pandas: Pipe, Apply, Agg, Transform y Applymap



---
### Pipe


---

Permite aplicar funciones de forma encadenada que reciban y retornen dataframes

In [ ]:

import numpy as np
import pandas as pd

a = np.random.randint(low=0, high=10, size=(5, 3))
df = pd.DataFrame(data=a, columns=['A', 'B', 'C'])
print(df)

# Creamos las funciones
def funcion1(dataframe):
    return dataframe.multiply(-2)

def funcion2(dataframe, col):
    # col = (col^2 + col)^(1/2)
    dataframe[col] = np.sqrt(dataframe[col]**2 + dataframe[col])
    return dataframe


# Creamos el pipe con las funciones anteriores
print(df.pipe(funcion1).pipe(funcion2, 'A'))

   A  B  C
0  8  1  5
1  6  3  8
2  1  2  3
3  8  5  6
4  4  5  3
           A   B   C
0  15.491933  -2 -10
1  11.489125  -6 -16
2   1.414214  -4  -6
3  15.491933 -10 -12
4   7.483315 -10  -6

---
### Apply


---

Permite aplicar funciones a dataframes, ya sean funciones existentes o definidas por el programador

In [ ]:
# función ya existente
print(df.apply(np.mean))
print(df.apply(np.mean, axis=1))

# función definida
print(df.apply(funcion1))
print("_--------")
print(df)

print(df.apply(lambda x: x.max() - x.min()))
print(df.apply(lambda x: x.max() - x.min(), axis=1))
df

A    5.4
B    3.2
C    5.0
dtype: float64
0    4.666667
1    5.666667
2    2.000000
3    6.333333
4    4.000000
dtype: float64
    A   B   C
0 -16  -2 -10
1 -12  -6 -16
2  -2  -4  -6
3 -16 -10 -12
4  -8 -10  -6
_--------
   A  B  C
0  8  1  5
1  6  3  8
2  1  2  3
3  8  5  6
4  4  5  3
A    7
B    4
C    5
dtype: int64
0    7
1    5
2    2
3    3
4    2
dtype: int64

   A  B  C
0  8  1  5
1  6  3  8
2  1  2  3
3  8  5  6
4  4  5  3

---
### Agg


---

Crea un nuevo dataframe con una fila por cada función aplicada a cada una de las columnas de un dataframe de entrada

In [ ]:
print (df)
print(df.agg(['sum', 'mean']))
print(df.agg([np.sum, 'mean']))

   A  B  C
0  8  1  5
1  6  3  8
2  1  2  3
3  8  5  6
4  4  5  3
         A     B     C
sum   27.0  16.0  25.0
mean   5.4   3.2   5.0
         A     B     C
sum   27.0  16.0  25.0
mean   5.4   3.2   5.0

---
### Transform


---

Crea un nuevo dataframe con los datos resultantes de aplicar una o varias funciones a cada uno de los elementos de un dataframe de entrada

In [ ]:
df

   A  B  C
0  7  8  4
1  3  3  9
2  8  0  8
3  3  6  4
4  3  2  7

In [ ]:

df1 = df.transform([np.abs, lambda x: x+1, funcion1])
df1

         A                          B  ...                 C
  absolute <lambda> funcion1 absolute  ... funcion1 absolute <lambda> funcion1
0        7        8      -14        8  ...      -16        4        5       -8
1        3        4       -6        3  ...       -6        9       10      -18
2        8        9      -16        0  ...        0        8        9      -16
3        3        4       -6        6  ...      -12        4        5       -8
4        3        4       -6        2  ...       -4        7        8      -14

[5 rows x 9 columns]

---
### Applymap


---

Permite aplicar a un dataframe una función que recibe y retorna un único valor

In [ ]:

f = lambda x: len(str(x/1000))
print(df.applymap(f))

   A  B  C
0  5  5  5
1  3  5  5
2  3  5  5
3  5  5  5
4  3  5  5